In [1]:
#importing the libraries
library(tidyr)
library(tidyverse)

── Attaching packages ─────────────────────────────────────── tidyverse 1.2.1 ──
✔ ggplot2 3.0.0     ✔ purrr   0.2.5
✔ tibble  1.4.2     ✔ dplyr   0.7.6
✔ readr   1.1.1     ✔ stringr 1.3.1
✔ ggplot2 3.0.0     ✔ forcats 0.3.0
── Conflicts ────────────────────────────────────────── tidyverse_conflicts() ──
✖ dplyr::filter() masks stats::filter()
✖ dplyr::lag()    masks stats::lag()

In [2]:
#reading the data into a dataframe
tb <- read.csv("/Users/manoharsaijasti/tb-untidy.csv", stringsAsFactors = FALSE)
tb <- as.tibble(tb)
head(tb)

  country year m04 m514 m014 m1524 m2534 m3544 m4554 m5564 ⋯ f04 f514 f014
1 AD      2000 NA  NA    0     0     1     0     0    0    ⋯ NA  NA   NA
2 AE      2000 NA  NA    2     4     4     6     5   12    ⋯ NA  NA    3
3 AF      2000 NA  NA   52   228   183   149   129   94    ⋯ NA  NA   93
4 AG      2000 NA  NA    0     0     0     0     0    0    ⋯ NA  NA    1
5 AL      2000 NA  NA    2    19    21    14    24   19    ⋯ NA  NA    3
6 AM      2000 NA  NA    2   152   130   131    63   26    ⋯ NA  NA    1
  f1524 f2534 f3544 f4554 f5564 f65 fu
1  NA    NA    NA    NA   NA    NA  NA
2  16     1     3     0    0     4  NA
3 414   565   339   205   99    36  NA
4   1     1     0     0    0     0  NA
5  11    10     8     8    5    11  NA
6  24    27    24     8    8     4  NA

In [3]:
#deleting the columns which are having all the null values in it
tb$m04 <- NULL
tb$m514 <- NULL
tb$mu<-NULL
tb$f04<-NULL
tb$f514 <- NULL
tb$fu <- NULL

In [4]:
#replacing the column names contained 'm' to 'm.' and 'f' to 'f.' for easy cleaning. 
names(tb) <- str_replace(names(tb), "m", "m.")
names(tb) <- str_replace(names(tb), 'f', 'f.')
head(tb)

  country year m.014 m.1524 m.2534 m.3544 m.4554 m.5564 m.65 f.014 f.1524
1 AD      2000  0      0      1      0      0     0      0   NA     NA
2 AE      2000  2      4      4      6      5    12     10    3     16
3 AF      2000 52    228    183    149    129    94     80   93    414
4 AG      2000  0      0      0      0      0     0      1    1      1
5 AL      2000  2     19     21     14     24    19     16    3     11
6 AM      2000  2    152    130    131     63    26     21    1     24
  f.2534 f.3544 f.4554 f.5564 f.65
1  NA     NA     NA    NA     NA
2   1      3      0     0      4
3 565    339    205    99     36
4   1      0      0     0      0
5  10      8      8     5     11
6  27     24      8     8      4

In [5]:
#gathering the columns that are not variables
tb <- gather(tb, column, value, m.014:f.65, na.rm=TRUE)
head(tb)

  country year column value
1 AD      2000 m.014   0
2 AE      2000 m.014   2
3 AF      2000 m.014  52
4 AG      2000 m.014   0
5 AL      2000 m.014   2
6 AM      2000 m.014   2

In [6]:
#seperating the column which has rows as variables in it to seperate variables
tb <- separate(tb, column, into = c("sex", "age_group"), na.rm=TRUE)
head(tb)

  country year sex age_group value
1 AD      2000 m   014        0
2 AE      2000 m   014        2
3 AF      2000 m   014       52
4 AG      2000 m   014        0
5 AL      2000 m   014        2
6 AM      2000 m   014        2

In [8]:
#processing the strings of age to look in a clean way. 
tb$age_group <- str_replace_all(tb$age_group, "0", "0-")
tb$age_group <- str_replace_all(tb$age_group, "15", "15-")
tb$age_group <- str_replace_all(tb$age_group, "25", "25-")
tb$age_group <- str_replace_all(tb$age_group, "35", "35-")
tb$age_group <- str_replace_all(tb$age_group, "45", "45-")
tb$age_group <- str_replace_all(tb$age_group, "55", "55-")
tb$age_group <- str_replace_all(tb$age_group, "65", "65-100")

In [9]:
#writing the cleaned tb data to a csv file
write_csv(tb, "tb_cleaned.csv")